# 2.7.1

# В чём преимущества ООП?

# применение принципов ООП помогает распределять
# ответственность в программе между классами +++

# улучшает модульность кода +++

# повышает гибкость кода +++

# ускоряет выполнение кода

# улучшает читаемость кода +++

# 2.7.2

# Какой декоратор используется для создания виртуальных «полей»
# данных класса?

# staticmethod

# classmethod

# property +++

# field

# class

# 2.7.3

# Что делает метод __str__ класса?

# генерирует строку описания класса

# преобразует данные класса в строку

# возвращает строковое представление объекта класса +++

# создает класс из строки

# 2.7.4

# Что возвращает поле __doc__?

# краткое описание класса +++

# ссылку на документацию Python

# полную документацию по модулю

# документ в формате .doc c описание класса

# 2.7.5

# Что делает ключевое слово raise?

# генерирует исключение +++

# поднимает уровень отладки

# это не ключевое слово, а функция

# восстанавливает работу программы после исключения